# PANDAS - It is a library in python.

In [ ]:
# Similar to NumPy, Pandas is one of the most widely used python libraries in data science.
# It provides high-performance, easy to use structures and data analysis tools. 
# Unlike NumPy library which provides objects for multi-dimensional arrays.
# Pandas provides in-memory 2d table object called Dataframe.
# It is used for Data manipulation & cancellation.

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
l=[(1,2,3),(3,4,5),(5,6,7),(7,8,9)]

In [4]:
arr1=np.array(l)

In [5]:
arr1

array([[1, 2, 3],
       [3, 4, 5],
       [5, 6, 7],
       [7, 8, 9]])

# Now pandas started

# Data Frame in Pandas

In [6]:
df=pd.DataFrame(arr1)   #command for creating a dataframe (D and F should always be capital) otherwise it will give an error

In [7]:
df

   0  1  2
0  1  2  3
1  3  4  5
2  5  6  7
3  7  8  9

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df.shape    # 4rows and 3columns (Row is a data point)(Column is a feature or series)

(4, 3)

In [10]:
df.size

12

In [11]:
df.ndim

2

# df.index (Row)

In [12]:
df.index     #This is for rows

RangeIndex(start=0, stop=4, step=1)

In [13]:
#Here 0 is included and 4 is excluded and the step=1 indicates difference between elements

# df.column (Column)

In [14]:
df.columns   #This is for columns

RangeIndex(start=0, stop=3, step=1)

In [15]:
# 0 included and 3 is excluded
#Hence we have 3 columns (0,1,2)
# df.rows command will not be used

# df.info

In [ ]:
# It will return information about the dataframe including the data types of each column and memory usage of the entire data

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
0    4 non-null int32
1    4 non-null int32
2    4 non-null int32
dtypes: int32(3)
memory usage: 128.0 bytes

In [17]:
#In first column i.e 0 there are four values (1,3,5,7) and that non-null indicates there is not any space left is empty

In [18]:
df.dtypes # It returns a Series with the data type of each column.

0    int32
1    int32
2    int32
dtype: object

# df.head
#df.head() indicates the upper half value of matrix if bracket() is empty.
#And if we assign value in () then it will shows the value till that from upper matrix

In [ ]:
#  used to return top n (5 by default) rows of a data frame or series.

In [19]:
df.head()

   0  1  2
0  1  2  3
1  3  4  5
2  5  6  7
3  7  8  9

In [20]:
df.head(0)

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [21]:
df.head(1)

   0  1  2
0  1  2  3

In [22]:
df.head(2)

   0  1  2
0  1  2  3
1  3  4  5

# df.tail
#Similarly as df.head() but only difference is that it will indicates the value from lower side of matrix

In [ ]:
#  used to return the last n rows.

In [23]:
df.tail()

   0  1  2
0  1  2  3
1  3  4  5
2  5  6  7
3  7  8  9

In [24]:
df.tail(0)

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [25]:
df.tail(1)

   0  1  2
3  7  8  9

In [26]:
df.tail(3)

   0  1  2
1  3  4  5
2  5  6  7
3  7  8  9

# df.unique
#Only available for column
#df[column head].unique

In [ ]:
# unique values in a particular column, which can be done using Pandas unique() function.

In [27]:
df

   0  1  2
0  1  2  3
1  3  4  5
2  5  6  7
3  7  8  9

In [28]:
df[0].unique

<bound method Series.unique of 0    1
1    3
2    5
3    7
Name: 0, dtype: int32>

In [29]:
df[1].unique

<bound method Series.unique of 0    2
1    4
2    6
3    8
Name: 1, dtype: int32>

In [30]:
df[2].unique

<bound method Series.unique of 0    3
1    5
2    7
3    9
Name: 2, dtype: int32>

# df[] 
#Only available for column
#df[] column head inside the bracket

In [31]:
df[0]

0    1
1    3
2    5
3    7
Name: 0, dtype: int32

In [32]:
df[2]

0    3
1    5
2    7
3    9
Name: 2, dtype: int32

# Type of column - It will always be series
#Indicates that the column is in series and column should be in series

In [33]:
type(df[0])

pandas.core.series.Series

In [34]:
type(df[2])

pandas.core.series.Series

# df[].nunique() 
#It is also only available for column
#Gives the no. of unique elements in the column

In [35]:
df

   0  1  2
0  1  2  3
1  3  4  5
2  5  6  7
3  7  8  9

In [36]:
df[0].nunique()

4

In [37]:
df[1].nunique()

4

# Now another example by changing the rows and columns by alphabet

In [38]:
#Here for rows we have to give as index and for column as column

In [39]:
df=pd.DataFrame(arr1,index=['a','b','c','d'],columns=['x','y','z'])

In [40]:
df

   x  y  z
a  1  2  3
b  3  4  5
c  5  6  7
d  7  8  9

# df[[]]
#For indicating individual or multiple columns

In [41]:
df[['x','z']]

   x  z
a  1  3
b  3  5
c  5  7
d  7  9

# df.loc[] & df.iloc[] 
#Now, iloc and loc
#Uses for INDEXING
#iloc is use for numbers -  Purely integer-location based indexing for selection by position. . iloc[] is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array.
#loc is use for alphabets- loc[] method is a method that takes only index labels and returns row or dataframe if the index label exists in the caller data frame.

In [42]:
df

   x  y  z
a  1  2  3
b  3  4  5
c  5  6  7
d  7  8  9

In [47]:
df.iloc[1,2]

5

In [48]:
df.loc['b','z']

5

# Renaming

In [49]:
df.rename(columns={'x':'f'},inplace=True)

In [50]:
df

   f  y  z
a  1  2  3
b  3  4  5
c  5  6  7
d  7  8  9

In [51]:
df.rename(index={'d':'k'},inplace=True)    #for Row(Index)

In [52]:
df

   f  y  z
a  1  2  3
b  3  4  5
c  5  6  7
k  7  8  9

# Deleting Columns

In [54]:
df.drop(labels=['f'],axis=1,inplace=True)

In [55]:
df

   y  z
a  2  3
b  4  5
c  6  7
k  8  9

In [184]:
#labels is a keyword it can't be replce
#axis=1 is also important as it gives the axis of column and it should be 1
#If we doesn't give axis then it will be by default 0 and there will be no changes it will give error

# Dictionary in Pandas -- Keys are converted to Columns

In [56]:
d={'a':[1,2,3],'b':[8,9,10]}

In [57]:
d

{'a': [1, 2, 3], 'b': [8, 9, 10]}

In [58]:
df1=pd.DataFrame(d)

In [59]:
df1

   a   b
0  1   8
1  2   9
2  3  10

# Series in Pandas --  Keys are converted to index

In [60]:
m={'a':9,'b':11}

In [61]:
m

{'a': 9, 'b': 11}

In [62]:
s=pd.Series(m)     # Series Command

In [63]:
s

a     9
b    11
dtype: int64

In [64]:
n={'x':7,'y':8,'z':6}

In [65]:
s1=pd.Series(n)

In [66]:
s1

x    7
y    8
z    6
dtype: int64